# Types of t- test

In [1]:
import seaborn as sns 
import pandas  as pd
import numpy as np

In [2]:
df=sns.load_dataset('titanic')
df.head()

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone
0,0,3,male,22.0,1,0,7.2500,S,Third,man,True,NaN,Southampton,no,False
1,1,1,female,38.0,1,0,71.2833,C,First,woman,False,C,Cherbourg,yes,False
2,1,3,female,26.0,0,0,7.9250,S,Third,woman,False,NaN,Southampton,yes,True
3,1,1,female,35.0,1,0,53.1000,S,First,woman,False,C,Southampton,yes,False
4,0,3,male,35.0,0,0,8.0500,S,Third,man,True,NaN,Southampton,no,True

In [3]:
df=df[['sex', 'age','fare', 'class']]

In [9]:
df=df.dropna()

In [10]:
df.isna().sum()

sex      0
age      0
fare     0
class    0
dtype: int64

# One SaMPLE T test
**Assumption**
- Data is normally distributed
- Observation in the sample is independent and identical distributed

In [7]:
df.fare.mean()

34.694514005602244

In [11]:
from scipy.stats import ttest_1samp
ttest_1samp(df['fare'], 34)

Ttest_1sampResult(statistic=0.35068651304765996, pvalue=0.7259271288562582)

# Independent student t test
**Assumptions**
- Data is normally distributed
- Observation in the sample is independent and identical distributed
- Observation in each sample has same variance

In [12]:
from scipy.stats import ttest_ind
df_male=df[df['sex']=='male']
df_female=df[df['sex']=='female']

ttest_ind(df_male['age'], df_female['age'])
stat, p_value= ttest_ind(df_male['age'], df_female['age'])
print('stat=', stat,'p=', p_value )
if p_value > 0.05:
    print('There is no signficent diff')
else:
    print('There is signficent diff')

stat= 2.499206354920835 p= 0.012671296797013709
There is signficent diff

# P*aired ttest
**Assumptions**
- Data is normally distributed
- Observation in the sample is independent and identical distributed
- Observation in each sample has same variance
- Obervation across each sample are paired

In [13]:
df_female

        sex   age     fare   class
1    female  38.0  71.2833   First
2    female  26.0   7.9250   Third
3    female  35.0  53.1000   First
8    female  27.0  11.1333   Third
9    female  14.0  30.0708  Second
..      ...   ...      ...     ...
879  female  56.0  83.1583   First
880  female  25.0  26.0000  Second
882  female  22.0  10.5167   Third
885  female  39.0  29.1250   Third
887  female  19.0  30.0000   First

[261 rows x 4 columns]

In [7]:
df_female_first=df_female[df_female['class']=='First']
df_female_third=df_female[df_female['class']=='Third']

In [15]:
df_female_third

        sex   age     fare  class
2    female  26.0   7.9250  Third
8    female  27.0  11.1333  Third
10   female   4.0  16.7000  Third
14   female  14.0   7.8542  Third
18   female  31.0  18.0000  Third
..      ...   ...      ...    ...
863  female   NaN  69.5500  Third
875  female  15.0   7.2250  Third
882  female  22.0  10.5167  Third
885  female  39.0  29.1250  Third
888  female   NaN  23.4500  Third

[144 rows x 4 columns]

In [20]:


df_1st=df_female_first.sample(n=100, replace= True)
df_3rd=df_female_third.sample(n=100, replace= True)

In [22]:
from scipy.stats import ttest_rel

df_1st=df_female_first.sample(n=100, replace= True)
df_3rd=df_female_third.sample(n=100, replace= True)
 
ttest_rel(df_1st['age'], df_3rd['age'])
stat, p_value=ttest_rel(df_1st['age'], df_3rd['age'])
print('stat=', stat,'p=', p_value )
if p_value > 0.05:
    print('There is no signficent diff')
else:
    print('There is signficent diff')

stat= 7.098568820026157 p= 1.9320058831143905e-10
There is signficent diff